system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

lx0 0;
ly0 0;
lz0 0;

lx1 1196;
ly1 1494;
lz1 1;

vertices
(
    ($lx0 $ly0 $lz0)   //0
    ($lx1 $ly0 $lz0)   //1
    ($lx1 $ly1 $lz0)   //2
    ($lx0 $ly1 $lz0)   //3
    ($lx0 $ly0 $lz1)   //4
    ($lx1 $ly0 $lz1)   //5
    ($lx1 $ly1 $lz1)   //6
    ($lx0 $ly1 $lz1)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (315 390 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type symmetryPlane;
        faces
        (
            (7 6 3 2)
        );
    }

    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
	        (4 5 6 7)
        );
    }
);

//mergePatchPairs
//(
//);

// ************************************************************************* //
