constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          189;
        startFace       82614;
    }
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          290;
        startFace       82803;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          153;
        startFace       83093;
    }
    outlet
    {
        type            patch;
        nFaces          257;
        startFace       83246;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          86178;
        startFace       83503;
    }
    solids
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6239;
        startFace       169681;
    }
)

// ************************************************************************* //
